<template>
  <main class="content_wrap">
    <div class="title">
      <h1>회원가입</h1>
      <div class="prog">
        <span class="now">01.약관동의</span>
        <i class="fa-solid fa-caret-right"></i>
        <span class="inactive">02.정보입력</span>
        <i class="fa-solid fa-caret-right"></i>
        <span class="inactive">03.가입완료</span>
      </div>
    </div>
    <div class="join_wrap">
      <div class="txt_wrap">
        <h2>회원가입약관</h2>
        <div id="termsOfService" class="txtbox">
          <p>
            제 1 장 총 칙
            <br/>
            <br/>
            <br/>
            제 1 조 (목적)
            <br/>
            이 약관은 펫테랑동물병원(이하 "사이트"라 합니다)에서 제공하는 인터넷서비스(이하 "서비스"라 합니다)의 이용 조건 및 절차에 관한 기본적인 사항을 규정함을 목적으로 합니다.
            <br/>
            <br/>
            <br/>
            제 2 조 (약관의 효력 및 변경)
            <br/>
            ① 이 약관은 서비스 화면이나 기타의 방법으로 이용고객에게 공지함으로써 효력을 발생합니다.
            <br/>
            ② 사이트는 이 약관의 내용을 변경할 수 있으며, 변경된 약관은 제1항과 같은 방법으로 공지 또는 통지함으로써 효력을 발생합니다.
            <br/>
            <br/>
            <br/>
            제 3 조 (용어의 정의)
            <br/>
            이 약관에서 사용하는 용어의 정의는 다음과 같습니다.
            <br/>
            ① 회원 : 사이트와 서비스 이용계약을 체결하거나 이용자 아이디(ID)를 부여받은 개인 또는 단체를 말합니다.
            <br/>
            ② 신청자 : 회원가입을 신청하는 개인 또는 단체를 말합니다.
            <br/>
            ③ 아이디(ID) : 회원의 식별과 서비스 이용을 위하여 회원이 정하고 사이트가 승인하는 문자와 숫자의 조합을 말합니다.
            <br/>
            ④ 비밀번호 : 회원이 부여 받은 아이디(ID)와 일치된 회원임을 확인하고, 회원 자신의 비밀을 보호하기 위하여 회원이 정한 문자와 숫자의 조합을 말합니다.
            <br/>
            ⑤ 해지 : 사이트 또는 회원이 서비스 이용계약을 취소하는 것을 말합니다.
            <br/>
            <br/>
            <br/>
            제 2 장 서비스 이용계약
            <br/>
            <br/>
            <br/>
            제 4 조 (이용계약의 성립)
            <br/>
            ① 이용약관 하단의 동의 버튼을 누르면 이 약관에 동의하는 것으로 간주됩니다.
            <br/>
            ② 이용계약은 서비스 이용희망자의 이용약관 동의 후 이용 신청에 대하여 사이트가 승낙함으로써 성립합니다.
            <br/>
            <br/>
            <br/>
            제 5 조 (이용신청)
            <br/>
            ① 신청자가 본 서비스를 이용하기 위해서는 사이트 소정의 가입신청 양식에서 요구하는 이용자 정보를 기록하여 제출해야 합니다.
            <br/>
            ② 가입신청 양식에 기재하는 모든 이용자 정보는 모두 실제 데이터인 것으로 간주됩니다.
            <br/>
            실명이나 실제 정보를 입력하지 않은 사용자는 법적인 보호를 받을 수 없으며, 서비스의 제한을 받을 수 있습니다.
            <br/>
            <br/>
            <br/>
            제 6 조 (이용신청의 승낙)
            <br/>
            ① 사이트는 신청자에 대하여 제2항, 제3항의 경우를 예외로 하여 서비스 이용신청을 승낙합니다.
            <br/>
            ② 사이트는 다음에 해당하는 경우에 그 신청에 대한 승낙 제한사유가 해소될 때까지 승낙을 유보할 수 있습니다.
            <br/>
            가. 서비스 관련 설비에 여유가 없는 경우
            <br/>
            나. 기술상 지장이 있는 경우
            <br/>
            다. 기타 사이트가 필요하다고 인정되는 경우
            <br/>
            ③ 사이트는 신청자가 다음에 해당하는 경우에는 승낙을 거부할 수 있습니다.
            <br/>
            가. 다른 개인(사이트)의 명의를 사용하여 신청한 경우
            <br/>
            나. 이용자 정보를 허위로 기재하여 신청한 경우
            <br/>
            다. 사회의 안녕질서 또는 미풍양속을 저해할 목적으로 신청한 경우
            <br/>
            라. 기타 사이트 소정의 이용신청요건을 충족하지 못하는 경우
            <br/>
            <br/>
            <br/>
            제 7 조 (이용자정보의 변경)
            <br/>
            회원은 이용 신청시에 기재했던 회원정보가 변경되었을 경우에는, 온라인으로 수정하여야 하며 변경하지 않음으로 인하여 발생되는 모든 문제의 책임은 회원에게 있습니다.
            <br/>
            <br/>
            <br/>
            제 3 장 계약 당사자의 의무
            <br/>
            <br/>
            <br/>
            제 8 조 (사이트의 의무)
            <br/>
            ① 사이트는 회원에게 각 호의 서비스를 제공합니다.
            <br/>
            가. 신규서비스와 도메인 정보에 대한 뉴스레터 발송
            <br/>
            나. 추가 도메인 등록시 개인정보 자동 입력
            <br/>
            다. 도메인 등록, 관리를 위한 각종 부가서비스
            <br/>
            ② 사이트는 서비스 제공과 관련하여 취득한 회원의 개인정보를 회원의 동의없이 타인에게 누설, 공개 또는 배포할 수 없으며, 서비스관련 업무 이외의 상업적 목적으로 사용할 수 없습니다.
            <br/>
            단, 다음 각 호의 1에 해당하는 경우는 예외입니다.
            <br/>
            가. 전기통신기본법 등 법률의 규정에 의해 국가기관의 요구가 있는 경우
            <br/>
            나. 범죄에 대한 수사상의 목적이 있거나 정보통신윤리 위원회의 요청이 있는 경우
            <br/>
            다. 기타 관계법령에서 정한 절차에 따른 요청이 있는 경우
            <br/>
            ③ 사이트는 이 약관에서 정한 바에 따라 지속적, 안정적으로 서비스를 제공할 의무가 있습니다.
            <br/>
            <br/>
            <br/>
            제 9 조 (회원의 의무)
            <br/>
            ① 회원은 서비스 이용 시 다음 각 호의 행위를 하지 않아야 합니다.
            <br/>
            가. 다른 회원의 ID를 부정하게 사용하는 행위
            <br/>
            나. 서비스에서 얻은 정보를 사이트의 사전승낙 없이 회원의 이용 이외의 목적으로 복제하거나 이를 변경, 출판 및 방송 등에 사용하거나 타인에게 제공하는 행위
            <br/>
            다. 사이트의 저작권, 타인의 저작권 등 기타 권리를 침해하는 행위
            <br/>
            라. 공공질서 및 미풍양속에 위반되는 내용의 정보, 문장, 도형 등을 타인에게 유포하는 행위
            <br/>
            마. 범죄와 결부된다고 객관적으로 판단되는 행위
            <br/>
            바. 기타 관계법령에 위배되는 행위
            <br/>
            ② 회원은 관계법령, 이 약관에서 규정하는 사항, 서비스 이용 안내 및 주의 사항을 준수하여야 합니다.
            <br/>
            ③ 회원은 내용별로 사이트가 서비스 공지사항에 게시하거나 별도로 공지한 이용 제한 사항을 준수하여야 합니다.
            <br/>
            <br/>
            <br/>
            제 4 장 서비스 제공 및 이용
            <br/>
            <br/>
            <br/>
            제 10 조 (회원 아이디(ID)와 비밀번호 관리에 대한 회원의 의무)
            <br/>
            ① 아이디(ID)와 비밀번호에 대한 모든 관리는 회원에게 책임이 있습니다. 회원에게 부여된 아이디(ID)와 비밀번호의 관리소홀, 부정사용에 의하여 발생하는 모든 결과에 대한 전적인 책임은 회원에게 있습니다.
            <br/>
            ② 자신의 아이디(ID)가 부정하게 사용된 경우 또는 기타 보안 위반에 대하여, 회원은 반드시 사이트에 그 사실을 통보해야 합니다.
            <br/>
            <br/>
            <br/>
            제 11 조 (서비스 제한 및 정지)
            <br/>
            ① 사이트는 전시, 사변, 천재지변 또는 이에 준하는 국가비상사태가 발생하거나 발생할 우려가 있는 경우와 전기통신사업법에 의한 기간통신 사업자가 전기통신서비스를 중지하는 등 기타 불가항력적 사유가 있는 경우에는 서비스의 전부 또는 일부를 제한하거나 정지할 수 있습니다.
            <br/>
            ② 사이트는 제1항의 규정에 의하여 서비스의 이용을 제한하거나 정지할 때에는 그 사유 및 제한기간 등을 지체없이 회원에게 알려야 합니다.
            <br/>
            <br/>
            <br/>
            제5장 계약사항의 변경, 해지
            <br/>
            <br/>
            <br/>
            제 12 조 (정보의 변경)
            <br/>
            회원이 주소, 비밀번호 등 고객정보를 변경하고자 하는 경우에는 홈페이지의 회원정보 변경 서비스를 이용하여 변경할 수 있습니다.
            <br/>
            <br/>
            <br/>
            제 13 조 (계약사항의 해지)
            <br/>
            회원은 서비스 이용계약을 해지할 수 있으며, 해지할 경우에는 본인이 직접 서비스를 통하거나 전화 또는 온라인 등으로 사이트에 해지신청을 하여야 합니다. 사이트는 해지신청이 접수된 당일부터 해당 회원의 서비스 이용을 제한합니다. 사이트는 회원이 다음 각 항의 1에 해당하여 이용계약을 해지하고자 할 경우에는 해지조치 7일전까지 그 뜻을 이용고객에게 통지하여 소명할 기회를 주어야 합니다.
            <br/>
            ① 이용고객이 이용제한 규정을 위반하거나 그 이용제한 기간 내에 제한 사유를 해소하지 않는 경우
            <br/>
            ② 정보통신윤리위원회가 이용해지를 요구한 경우
            <br/>
            ③ 이용고객이 정당한 사유 없이 의견진술에 응하지 아니한 경우
            <br/>
            ④ 타인 명의로 신청을 하였거나 신청서 내용의 허위 기재 또는 허위서류를 첨부하여 이용계약을 체결한 경우
            <br/>
            사이트는 상기 규정에 의하여 해지된 이용고객에 대해서는 별도로 정한 기간동안 가입을 제한할 수 있습니다.
            <br/>
            <br/>
            <br/>
            제6장 손해배상
            <br/>
            <br/>
            <br/>
            제 14 조 (면책조항)
            <br/>
            ① 사이트는 회원이 서비스 제공으로부터 기대되는 이익을 얻지 못하였거나 서비스 자료에 대한 취사선택 또는 이용으로 발생하는 손해 등에 대해서는 책임이 면제됩니다.
            <br/>
            ② 사이트는 회원의 귀책사유나 제3자의 고의로 인하여 서비스에 장애가 발생하거나 회원의 데이터가 훼손된 경우에 책임이 면제됩니다.
            <br/>
            ③ 사이트는 회원이 게시 또는 전송한 자료의 내용에 대해서는 책임이 면제됩니다.
            <br/>
            ④ 상표권이 있는 도메인의 경우, 이로 인해 발생할 수도 있는 손해나 배상에 대한 책임은 구매한 회원 당사자에게 있으며, 사이트는 이에 대한 일체의 책임을 지지 않습니다.
            <br/>
            <br/>
            <br/>
            제 15 조 (관할법원)
            <br/>
            <br/>
            <br/>
            서비스와 관련하여 사이트와 회원간에 분쟁이 발생할 경우 사이트의 본사 소재지를 관할하는 법원을 관할법원으로 합니다.
            <br/>
            <br/>
            <br/>
            [부칙]
            <br/>
            <br/>
            <br/>
            (시행일) 이 약관은 2023년 12월부터 시행합니다.
          </p>
        </div>
        <div class="agreement">
          <label for="agreement1">회원가입약관의 내용에 동의합니다.</label>
          <input type="checkbox" id="agreement1" v-model="checkbox1" />
        </div>
      </div>
      <div class="txt_wrap">
        <h2>개인정보수집이용안내</h2>
        <div id="privacyPolicy" class="txtbox">
          <p>
            개인정보처리방침
            <br/>
            <br/>
            <br/>
            [차례]
            <br/>
            1. 총칙
            <br/>
            2. 개인정보 수집에 대한 동의
            <br/>
            3. 개인정보의 수집 및 이용목적
            <br/>
            4. 수집하는 개인정보 항목
            <br/>
            5. 개인정보 자동수집 장치의 설치, 운영 및 그 거부에 관한 사항
            <br/>
            6. 목적 외 사용 및 제3자에 대한 제공
            <br/>
            7. 개인정보의 열람 및 정정
            <br/>
            8. 개인정보 수집, 이용, 제공에 대한 동의철회
            <br/>
            9. 개인정보의 보유 및 이용기간
            <br/>
            10. 개인정보의 파기절차 및 방법
            <br/>
            11. 아동의 개인정보 보호
            <br/>
            12. 개인정보 보호를 위한 기술적 대책
            <br/>
            13. 개인정보의 위탁처리
            <br/>
            14. 의겸수렴 및 불만처리
            <br/>
            15. 부 칙(시행일)
            <br/>
            <br/>
            <br/>
            1. 총칙
            <br/>
            <br/>
            본 업체 사이트는 회원의 개인정보보호를 소중하게 생각하고, 회원의 개인정보를 보호하기 위하여 항상 최선을 다해 노력하고 있습니다.
            <br/>
            1) 회사는 「정보통신망 이용촉진 및 정보보호 등에 관한 법률」을 비롯한 모든 개인정보보호 관련 법률규정을 준수하고 있으며, 관련 법령에 의거한 개인정보처리방침을 정하여 이용자 권익 보호에 최선을 다하고 있습니다.
            <br/>
            2) 회사는 「개인정보처리방침」을 제정하여 이를 준수하고 있으며, 이를 인터넷사이트 및 모바일 어플리케이션에 공개하여 이용자가 언제나 용이하게 열람할 수 있도록 하고 있습니다.
            <br/>
            3) 회사는 「개인정보처리방침」을 통하여 귀하께서 제공하시는 개인정보가 어떠한 용도와 방식으로 이용되고 있으며 개인정보보호를 위해 어떠한 조치가 취해지고 있는지 알려드립니다.
            <br/>
            4) 회사는 「개인정보처리방침」을 홈페이지 첫 화면 하단에 공개함으로써 귀하께서 언제나 용이하게 보실 수 있도록 조치하고 있습니다.
            <br/>
            5) 회사는  「개인정보처리방침」을 개정하는 경우 웹사이트 공지사항(또는 개별공지)을 통하여 공지할 것입니다.
            <br/>
            <br/>
            2. 개인정보 수집에 대한 동의
            <br/>
            <br/>
            귀하께서 본 사이트의 개인정보보호방침 또는 이용약관의 내용에 대해 「동의 한다」버튼 또는 「동의하지 않는다」버튼을 클릭할 수 있는 절차를 마련하여, 「동의 한다」버튼을 클릭하면 개인정보 수집에 대해 동의한 것으로 봅니다.
            <br/>
            <br/>
            3. 개인정보의 수집 및 이용목적
            <br/>
            <br/>
            본 사이트는 다음과 같은 목적을 위하여 개인정보를 수집하고 있습니다.
            <br/>
            서비스 제공을 위한 계약의 성립 : 본인식별 및 본인의사 확인 등
            <br/>
            서비스의 이행 : 상품배송 및 대금결제
            <br/>
            회원 관리 : 회원제 서비스 이용에 따른 본인확인, 개인 식별, 연령확인, 불만처리 등 민원처리
            <br/>
            기타 새로운 서비스, 신상품이나 이벤트 정보 안내
            <br/>
            단, 이용자의 기본적 인권 침해의 우려가 있는 민감한 개인정보(인종 및 민족, 사상 및 신조, 출신지 및 본적지, 정치적 성향 및 범죄기록, 건강상태 등)는 수집하지 않습니다.
            <br/>
            <br/>
            4. 수집하는 개인정보 항목
            <br/>
            <br/>
            본 사이트는 회원가입, 상담, 서비스 신청 등을 위해 아래와 같은 개인정보를 수집하고 있습니다.
            <br/>
            1) 개인정보 수집방법 : 홈페이지(회원가입)
            <br/>
            2) 수집항목 : 이름 , 생년월일 , 성별 , 로그인ID , 비밀번호 , 전화번호 , 주소 , 휴대전화번호 , 이메일 , 주민등록번호 , 접속 로그 , 접속 IP 정보 , 결제기록
            <br/>
            <br/>
            <br/>
            5. 개인정보 자동수집 장치의 설치, 운영 및 그 거부에 관한 사항
            <br/>
            <br/>
            본 사이트는 귀하에 대한 정보를 저장하고 수시로 찾아내는 '쿠키(cookie)'를 사용합니다. 쿠키는 웹사이트가 귀하의 컴퓨터 브라우저(넷스케이프, 인터넷 익스플로러 등)로 전송하는 소량의 정보입니다. 귀하께서 웹사이트에 접속을 하면 본 사이트의 컴퓨터는 귀하의 브라우저에 있는 쿠키의 내용을 읽고, 귀하의 추가정보를 귀하의 컴퓨터에서 찾아 접속에 따른 성명 등의 추가 입력 없이 서비스를 제공할 수 있습니다.
            <br/>
            1) 쿠키는 귀하의 컴퓨터는 식별하지만 귀하를 개인적으로 식별하지는 않습니다. 또한 귀하는 쿠키에 대한 선택권이 있습니다. 웹브라우저의 옵션을 조정함으로써 모든 쿠키를 다 받아들이거나, 쿠키가 설치될 때 통지를 보내도록 하거나, 아니면 모든 쿠키를 거부할 수 있는 선택권을 가질 수 있습니다.
            <br/>
            2) 쿠키 등 사용 목적 : 이용자의 접속 빈도나 방문 시간 등을 분석, 이용자의 취향과 관심분야를 파악 및 자취 추적, 각종 이벤트 참여 정도 및 방문 회수 파악 등을 통한 타겟 마케팅 및 개인 맞춤 서비스 제공
            <br/>
            3) 쿠키 설정 거부 방법 : 쿠키 설정을 거부하는 방법으로는 귀하가 사용하는 웹 브라우저의 옵션을 선택함으로써 모든 쿠키를 허용하거나 쿠키를 저장할 때마다 확인을 거치거나, 모든 쿠키의 저장을 거부할 수 있습니다. 설정방법 예시 : 인터넷 익스플로어의 경우 → 웹 브라우저 상단의 도구 > 인터넷 옵션 > 개인정보
            <br/>
            단, 귀하께서 쿠키 설치를 거부하였을 경우 서비스 제공에 어려움이 있을 수 있습니다.
            <br/>
            <br/>
            <br/>
            6. 목적 외 사용 및 제3자에 대한 제공
            <br/>
            <br/>
            본 사이트는 귀하의 개인정보를 "개인정보의 수집목적 및 이용목적"에서 고지한 범위 내에서 사용하며, 동 범위를 초과하여 이용하거나 타인 또는 타 기업·기관에 제공하지 않습니다.
            <br/>
            그러나 보다 나은 서비스 제공을 위하여 귀하의 개인정보를 업체 자회사 또는 제휴사에게 제공하거나, 업체 자회사 또는 제휴사와 공유할 수 있습니다. 개인정보를 제공하거나 공유할 경우에는 사전에 귀하께 업체 자회사 그리고 제휴사가 누구인지, 제공 또는 공유되는 개인정보항목이 무엇인지, 왜 그러한 개인정보가 제공되거나 공유되어야 하는지, 그리고 언제까지 어떻게 보호·관리되는지에 대해 개별적으로 전자우편 및 서면을 통해 고지하여 동의를 구하는 절차를 거치게 되며, 귀하께서 동의하지 않는 경우에는 업체 자회사 그리고 제휴사에게 제공하거나 공유하지 않습니다. 또한 이용자의 개인정보를 원칙적으로 외부에 제공하지 않으나, 아래의 경우에는 예외로 합니다.
            <br/>
            1) 이용자들이 사전에 동의한 경우
            <br/>
            2) 법령의 규정에 의거하거나, 수사 목적으로 법령에 정해진 절차와 방법에 따라 수사기관의 요구가 있는 경우
            <br/>
            <br/>
            <br/>
            7. 개인정보의 열람 및 정정
            <br/>
            <br/>
            귀하는 언제든지 등록되어 있는 귀하의 개인정보를 열람하거나 정정하실 수 있습니다. 개인정보 열람 및 정정을 하고자 할 경우에는 "회원정보수정"을 클릭하여 직접 열람 또는 정정하거나, 개인정보 최고관리책임자에게 E-mail로 연락하시면 조치하겠습니다.
            <br/>
            귀하가 개인정보의 오류에 대한 정정을 요청한 경우, 정정을 완료하기 전까지 당해 개인정보를 이용하지 않습니다.
            <br/>
            <br/>
            <br/>
            8. 개인정보 수집, 이용, 제공에 대한 동의철회
            <br/>
            <br/>
            회원가입 등을 통해 개인정보의 수집, 이용, 제공에 대해 귀하께서 동의하신 내용을 귀하는 언제든지 철회하실 수 있습니다. 동의철회는 "마이페이지"의 "회원탈퇴(동의철회)"를 클릭하거나 개인정보관리책임자에게 E-mail등으로 연락하시면 즉시 개인정보의 삭제 등 필요한 조치를 하겠습니다.
            <br/>
            본 사이트는 개인정보의 수집에 대한 회원탈퇴(동의철회)를 개인정보 수집시와 동등한 방법 및 절차로 행사할 수 있도록 필요한 조치를 하겠습니다.
            <br/>
            <br/>
            <br/>
            9. 개인정보의 보유 및 이용기간
            <br/>
            <br/>
            원칙적으로, 개인정보 수집 및 이용목적이 달성된 후에는 해당 정보를 지체 없이 파기합니다. 단, 다음의 정보에 대해서는 아래의 이유로 명시한 기간 동안 보존합니다.
            <br/>
            1) 보존 항목 : 회원가입정보(로그인ID, 이름, 별명)
            <br/>
            2) 보존 근거 : 회원 탈퇴 시 다른 회원이 기존 회원아이디로 재가입하여 활동하지 못하도록 하기 위함
            <br/>
            3) 보존 기간 : 영구
            <br/>
            그리고 상법 등 관계법령의 규정에 의하여 보존할 필요가 있는 경우 회사는 아래와 같이 관계법령에서 정한 일정한 기간 동안 거래 및 회원정보를 보관합니다.
            <br/>
            ⚪보존 항목 : 계약 또는 청약철회 기록, 대금 결제 및 재화공급 기록, 불만 또는 분쟁처리 기록
            <br/>
            ⚪보존 근거 : 전자상거래등에서의 소비자보호에 관한 법률 제6조 거래기록의 보존
            <br/>
            ⚪보존 기간 : 계약 또는 청약철회 기록(5년), 대금 결제 및 재화공급 기록(5년), 불만 또는 분쟁처리 기록(3년), 위 보유기간에도 불구하고 계속 보유하여야 할 필요가 있을 경우에는 귀하의 동의를 받겠습니다.
            <br/>
            ⚪회원이 1년간 서비스 이용기록이 없는 경우[정보통신망 이용촉진 및 정보보호 등에 관한 법률] 제 29조 '개인정보 유효 기간제'에 따라 회원에게 사전 통지하고 별도로 분리하여 저장합니다.
            <br/>
            4) 개인정보의 국외 보관에 대한 내용
            <br/>
            회사는 이용자로부터 취득 또는 생성한 개인정보를 미리내가 보유하고 있는 데이터베이스 (물리적보관소: 한국)에 저장합니다. 미리내는 해당 서버의 물리적인 관리만을 행하고, 원칙적으로 회원님의 개인정보에 접근하지 않습니다. 
            <br/>
            <br/>
            <br/>
            ⚪이전항목: 서비스 이용기록 또는 수집된 개인정보
            <br/>
            ⚪이전국가: 한국
            <br/>
            ⚪이전일시 및 방법: 전산 서버 수탁계약 이후 서비스 이용 시점에 네트워크를 통한 전송
            <br/>
            ⚪개인정보 보유 및 이용기간: 회원탈퇴시 혹은 위탁계약 종료시까지
            <br/>
            <br/>
            <br/>
            10. 개인정보의 파기절차 및 방법
            <br/>
            본 사이트는 원칙적으로 개인정보 수집 및 이용목적이 달성된 후에는 해당 정보를 지체 없이 파기합니다. 파기절차 및 방법은 다음과 같습니다.
            <br/>
            파기절차 : 귀하가 회원가입 등을 위해 입력하신 정보는 목적이 달성된 후 별도의 DB로 옮겨져(종이의 경우 별도의 서류함) 내부 방침 및 기타 관련 법령에 의한 정보보호 사유에 따라(보유 및 이용기간 참조) 일정 기간 저장된 후 파기되어집니다. 별도 DB로 옮겨진 개인정보는 법률에 의한 경우가 아니고서는 보유되어지는 이외의 다른 목적으로 이용되지 않습니다.
            <br/>
            파기방법 : 전자적 파일형태로 저장된 개인정보는 기록을 재생할 수 없는 기술적 방법을 사용하여 삭제합니다.
            <br/>
            <br/>
            <br/>
            11. 아동의 개인정보 보호
            <br/>
            <br/>
            본 사이트는 만14세 미만 아동의 개인정보를 수집하는 경우 법정대리인의 동의를 받습니다.
            <br/>
            만14세 미만 아동의 법정대리인은 아동의 개인정보의 열람, 정정, 동의철회를 요청할 수 있으며, 이러한 요청이 있을 경우 본 사이트는 지체 없이 필요한 조치를 취합니다.
            <br/>
            <br/>
            <br/>
            12. 개인정보 보호를 위한 기술적 대책
            <br/>
            <br/>
            본 사이트는 귀하의 개인정보를 취급함에 있어 개인정보가 분실, 도난, 누출, 변조 또는 훼손되지 않도록 안전성 확보를 위하여 다음과 같은 기술적 대책을 강구하고 있습니다.
            <br/>
            귀하의 개인정보는 비밀번호에 의해 보호되며, 파일 및 전송 데이터를 암호화하거나 파일 잠금기능(Lock)을 사용하여 중요한 데이터는 별도의 보안기능을 통해 보호되고 있습니다.
            <br/>
            본 사이트는 백신프로그램을 이용하여 컴퓨터바이러스에 의한 피해를 방지하기 위한 조치를 취하고 있습니다. 백신프로그램은 주기적으로 업데이트되며 갑작스런 바이러스가 출현할 경우 백신이 나오는 즉시 이를 제공함으로써 개인정보가 침해되는 것을 방지하고 있습니다.
            <br/>
            해킹 등에 의해 귀하의 개인정보가 유출되는 것을 방지하기 위해, 외부로부터의 침입을 차단하는 장치를 이용하고 있습니다.
            <br/>
            <br/>
            <br/>
            13. 개인정보의 위탁처리
            <br/>
            <br/>
            본 사이트는 서비스 향상을 위해서 귀하의 개인정보를 외부에 위탁하여 처리할 수 있습니다.
            <br/>
            개인정보의 처리를 위탁하는 경우에는 미리 그 사실을 귀하에게 고지하겠습니다.
            <br/>
            개인정보의 처리를 위탁하는 경우에는 위탁계약 등을 통하여 서비스제공자의 개인정보보호 관련 지시 엄수, 개인정보에 관한 비밀유지, 제3자 제공의 금지 및 사고시의 책임부담 등을 명확히 규정하고 당해 계약내용을 서면 또는 전자적으로 보관하겠습니다.
            <br/>
            <br/>
            <br/>
            14. 의견수렴 및 불만처리
            <br/>
            <br/>
            본 사이트는 개인정보보호와 관련하여 귀하가 의견과 불만을 제기할 수 있는 창구를 개설하고 있습니다. 개인정보와 관련한 불만이 있으신 분은 본 사이트의 개인정보 최고 관리책임자에게 의견을 주시면 접수 즉시 조치하여 처리결과를 통보해 드립니다.
            <br/>
            1) 개인정보 최고 관리책임자는 회사의 대표가 직접 맡아서 개인정보에 대한 강조를 하고 있습니다. 개인정보를 보호하고 유출을 방지하는 책임자로서 이용자가 안심하고 회사가 제공하는 서비스를 이용할 수 있도록 도와드리며, 개인정보를 보호하는데 있어 이용자에게 고지한 사항들에 반하여 사고가 발생할 시에는 이에 관한 책임을 집니다.
            <br/>
            2) 기술적인 보완조치를 취하였음에도 불구하고 악의적인 해킹 등 기본적인 네트워크상의 위험성에 의해 발생하는 예기치 못한 사고로 인한 정보의 훼손 및 멸실, 이용자가 작성한 게시물에 의한 각종 분쟁 등에 관해서는, 본 사이트 회사는 책임이 없습니다.
            <br/>
            3) 회사는 정보통신망 이용촉진 및 정보보호 등에 관한 법률에서 규정한 관리책임자를 다음과 같이 지정합니다.
            <br/>
            개인정보 최고 관리책임자 성명 : 
            <br/>
            전화번호 :
            <br/>
            이메일 : 
            <br/>
            또는 개인정보침해에 대한 신고나 상담이 필요하신 경우에는 아래 기관에 문의하시기 바랍니다.
            <br/>
            개인분쟁조정위원회 (www.1336.or.kr / 1336)
            <br/>
            정보보호마크인증위원회 (www.eprivacy.or.kr / 02-580-0533~4)
            <br/>
            대검찰청 인터넷범죄수사센터 (icic.sppo.go.kr / 02-3480-3600)
            <br/>
            경찰청 사이버테러대응센터 (www.ctrc.go.kr / 02-392-0330)
            <br/>
            <br/>
            <br/>
            15. 부 칙(시행일)
            <br/>
            <br/>
            현 개인정보처리방침은 2023년 12월 20일에 제정되었으며, 정부 및 회사의 정책 또는 보안기술의 변경에 따라 내용의 추가, 삭제 및 수정이 있을 경우에는 개정 최소 7일 전부터 ‘공지사항’란을 통해 고지하며, 본 정책은 시행 일자에 시행됩니다.
            <br/>
            1) 공고일자 : 2023년 12월 22일
            <br/>
            2) 시행일자 : 2023년 12월 22일
          </p>
        </div>
        <div class="agreement">
          <label for="agreement2">개인정보수집이용안내의 내용에 동의합니다.</label>
          <input type="checkbox" id="agreement2" v-model="checkbox2" />
        </div>
      </div>
      <div class="btn_wrap">
        <button class="button" :disabled="isButtonDisabled" @click="handleButtonClick">약관동의</button>
        <button class="button" @click="goBack">취소</button>
      </div>
    </div>
  </main>
</template>
<script>
export default {
  data() {
    return {
      checkbox1: false,
      checkbox2: false
    }
  },
  computed: {
    isButtonDisabled() {
      return !(this.checkbox1 && this.checkbox2);
    }
  },
  methods: {
    handleButtonClick() {
      this.$router.push({ path: "/join2" })
    },
    goBack() {
      this.$router.go(-1)
    }
  }
}
</script>
<style scoped>
@import "../assets/css/global.css";

.prog {
  font-size: var(--font-regular);
}

.prog .inactive {
  color: var(--color-gray);
  font-weight: 400;
}

.prog .now {
  font-size: 18px;
  font-weight: 500;
}

.prog .fa-solid {
  margin: 0 10px;
}

.join_wrap {
  width: 600px;
  margin: 50px auto;
}

.txt_wrap {
  margin-bottom: 50px;
}

.txt_wrap h2 {
  font-size: var(--font-medium);
  font-weight: 500;
  margin-bottom: 10px;
}

.txtbox {
  height: 200px;
  border-radius: 10px;
  border: #999 1px solid;
  padding: 20px;
  margin-bottom: 10px;
  overflow-y: scroll;
  word-break: keep-all;
}

.txtbox::-webkit-scrollbar {
  width: 10px;
}

.txtbox::-webkit-scrollbar-button {
  height: 5px;
}

.txtbox::-webkit-scrollbar-thumb {
  background-color: #999;
  border-radius: 5px;
}

.txtbox::-webkit-scrollbar-thumb:hover {
  background-image: linear-gradient(rgba(0, 0, 0, 0.2), rgba(0, 0, 0, 0.2));
}

.agreement {
  display: flex;
  justify-content: right;
}

.agreement input {
  margin-left: 5px;
}

.btn_wrap {
  margin: 0 auto;
  display: flex;
  justify-content: space-between;
  width: 100%;
}


</style>